In [3]:
import pandas as pd
from sklearn import linear_model
from word2number import w2n

# Linear Regression Hiring Data

In [4]:
data = pd.read_csv("Datasets/hiring.csv")

In [5]:
data.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [6]:
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [7]:
med = data["test_score(out of 10)"].mean()
data["test_score(out of 10)"] = data["test_score(out of 10)"].fillna(med)
data.experience.fillna("zero", inplace=True)
data

/tmp/ipykernel_50322/1879043931.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data.experience.fillna("zero", inplace=True)

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero               8.000000                           9      50000
1       zero               8.000000                           6      45000
2       five               6.000000                           7      60000
3        two              10.000000                          10      65000
4      seven               9.000000                           6      70000
5      three               7.000000                          10      62000
6        ten               7.857143                           7      72000
7     eleven               7.000000                           8      80000

In [8]:
data["experience"] = data["experience"].apply(w2n.word_to_num)

In [9]:
data

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0               8.000000                           9      50000
1           0               8.000000                           6      45000
2           5               6.000000                           7      60000
3           2              10.000000                          10      65000
4           7               9.000000                           6      70000
5           3               7.000000                          10      62000
6          10               7.857143                           7      72000
7          11               7.000000                           8      80000

In [24]:
reg = linear_model.LinearRegression()

In [28]:
X = data.drop(labels="salary($)", axis=1)   # input features
y = data["salary($)"]                # target/output

#### q1: 2yr experience, 9 test score, 6 interview score

In [15]:
reg.predict([[2, 9, 6]])

/usr/lib/python3.13/site-packages/sklearn/utils/validation.py:2739: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([[53290.89255945]])

#### q2: 12yr experience, 10 test score, 10 interview score

In [12]:
reg.predict([[12, 10, 10]])

/usr/lib/python3.13/site-packages/sklearn/utils/validation.py:2739: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([[92268.07227784]])

In [13]:
reg.predict([[0, 8, 9]])

/usr/lib/python3.13/site-packages/sklearn/utils/validation.py:2739: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([[52313.61238494]])

In [17]:
reg.coef_

array([[2827.63404314, 1912.93803053, 2196.9753141 ]])

## Training and Testing

In [29]:
from sklearn.model_selection import train_test_split

In [30]:
X_train , X_test , y_train, y_test = train_test_split(X,y,train_size=0.8)

In [34]:
reg.fit(X_train,y_train)
X_test
y_test

5    62000
6    72000
Name: salary($), dtype: int64

In [32]:
reg.predict(X_test)

array([59977.06422018, 78202.14324262])